cases/02_forcedChannelWetting/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}

application     interFlow;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.2;

deltaT          1e-06;

writeControl    adjustableRunTime;

writeInterval   0.001;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           1;

maxAlphaCo      0.2;

maxCapillaryNum 5;

maxDeltaT       1;

libs            ( "libfvOptionArtificialViscousInterfaceForce.so" );

functions
{
    alphaVolume
    {
        enabled         true;
        type            volFieldValue;
        libs            ( "libfieldFunctionObjects.so" );
        fields          ( alpha.water );
        writeFields     no;
        writeControl    writeTime;
        regionType      all;
        operation       volIntegrate;
        log             true;
    }
}


// ************************************************************************* //
