cases/02_forcedChannelWetting/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;
vertices
(
    (   0         0       0)
    (   4         0       0)
    (   4      0.0125   0)
    (   0      0.0125   0)
    (   0         0     0.2)
    (   4         0     0.2)
    (   4      0.0125 0.2)
    (   0      0.0125 0.2)
);

blocks
(
    // hex (0 1 2 3 4 5 6 7) (80 1 4) simpleGrading (1 1 1)
    
    // with constant cell size in y
    // hex (0 1 2 3 4 5 6 7) (80 1 4) simpleGrading (1 1 1)
     hex (0 1 2 3 4 5 6 7) (320 1 16) simpleGrading (1 1 1) //requires 0.0125
    // hex (0 1 2 3 4 5 6 7) (1280 1 64) simpleGrading (1 1 1) //requires 0.003125

    

    // with constant thickness
    // hex (0 1 2 3 4 5 6 7) (320 4 16) simpleGrading (1 1 1)
    // hex (0 1 2 3 4 5 6 7) (1280 16 64) simpleGrading (1 1 1)
);

edges
(
);

boundary               
(
    inlet              
    {
        type patch;    
        faces
        (
            (0 4 7 3) 
        );
    }                

    outlet             
    {
        type patch;    
        faces
        (
            (1 2 6 5)
        );
    }

    symmetry
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }

    front
    {
        type patch;
        faces
        (
            (0 1 5 4)
        );
    }

    back
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
); 

mergePatchPairs
(
);

// ************************************************************************* //

