cases/02_forcedChannelWetting/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water air);

water
{
    transportModel  Newtonian;
    nu              1e-06;
    rho             998.2;
}

air
{
    transportModel  Newtonian;
    nu              1.53e-05;
    rho             1.19;
}

sigma           0.07274;

surfaceForces //interFlow
{
    sigma       0.07274; 
    surfaceTensionForceModel fitParaboloid;
    accelerationModel gravity;
    deltaFunctionModel alphaCSF;
}

// ************************************************************************* //
