cases/02_forcedChannelWetting/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    { 
	type          fixedValue;
        value         uniform (0.01 0 0); // set by automation framework
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;
    }

    front
    {
        type            slip;
    }
    back
    {
        type            slip;
    }

    symmetry
    {
        type            slip;
    }

    bottom
    {
        type            partialSlip;
		valueFraction	uniform 0.333333333333;
    }

}


// ************************************************************************* //
