cases/02_forcedChannelWetting/0.org/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedFluxPressure;//zeroGradient;
        value           uniform 0;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0;
        //type            totalPressure;
        //p0              uniform 0;
    }

    symmetry
    {
        type            zeroGradient;
    }

    bottom
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    front
    {
        type            zeroGradient;
    }
    back
    {
        type            zeroGradient;
    }

    "cavity_bottom_.*"
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

}


// ************************************************************************* //
