cases/02_forcedChannelWetting/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.water.*"
    {   
        advectionScheme isoAdvection;
        reconstructionScheme plicRDF;

		isoFaceTol      1e-8;
        vof2IsoTol      1e-8;
        surfCellTol     1e-8;
        writeVTK 		false;
        snapTol         1e-12;
        nAlphaBounds    5;  
        clip            true;
        nAlphaCorr      2;  
        nAlphaSubCycles 1;
        cAlpha          1;

    }   

    "pcorr.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-10;
        relTol          0;
    }

    p_rgh
    {
        solver          GAMG;
        smoother        DICGaussSeidel;
        tolerance       1e-07;
        relTol          0.05;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance       1e-07;
        relTol          0;
    }

    "U.*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0;
    }

}


PIMPLE
{
    momentumPredictor true;
    nCorrectors     2;
    nOuterCorrectors 1;
    nNonOrthogonalCorrectors 0;
}


// ************************************************************************* //
